{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"John Doe","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Markdown中文版编辑器Tyora","slug":"mou","date":"2018-07-20T06:24:53.000Z","updated":"2018-07-20T06:24:59.920Z","comments":true,"path":"2018/07/20/mou/","link":"","permalink":"http://yoursite.com/2018/07/20/mou/","excerpt":"","text":"Typora(markdown编辑器)前言无意中发现了 Typora 这款 Markdown 编辑器。第一眼看上去它就像任何一款 Markdown 编辑器的同类，尤其是 Mou，但再看一眼，你就发现，它是如此的不同。 因为它将「写字」和「预览」这两件事情合并了，你输入的地方，也是输出的地方，即现在很流行的 WYSIWYG（What You See Is What You Get）。其实转念一想，这不就是回到了 Office Word 嘛，只不过编辑文本时不用再去工具栏上点选，一切的格式都能通过符号来控制。 用 Typora 官方的介绍视频，你就懂这一切是多么的自然。没错，所有的行内元素（如加粗、斜体）都会根据当前是否在编辑态而智能地在编辑态和预览态切换，而区块级元素（如标题、列表）则会在按下 Enter 后即时渲染，不能再次编辑。一切都变得如此干净、纯粹。接下来一起了解一下吧~ 概述Typora, the missing Markdown editor for web developers. 语法加粗强调strong or strong ( Cmd + B ) emphasize or emphasize ( Cmd + I ) Sometimes I want a lot of text to be bold.Like, seriously, a LOT of text 块引用 Right angle brackets &gt; are used for block quotes. 链接和电子邮件An email &#101;&#x78;&#97;&#109;&#112;&#x6c;&#101;&#x40;&#101;&#120;&#97;&#x6d;&#x70;&#108;&#x65;&#x2e;&#x63;&#111;&#x6d; link. Simple inline link http://chenluois.com, another inline link Smaller, one more inline link with title Resize. A reference style link. Input id, then anywhere in the doc, define the link with corresponding id: Titles ( or called tool tips ) in the links are optional. 图片An inline image , title is optional. A reference style image. 行内代码和块代码Inline code are surround by backtick key. To create a block code: Indent each line by at least 1 tab, or 4 spaces. var Mou = exactlyTheAppIwant; 有序列表Ordered lists are created using “1.” + Space: Ordered list item Ordered list item Ordered list item 无序列表Unordered list are created using “*” + Space: Unordered list item Unordered list item Unordered list item Or using “-“ + Space: Unordered list item Unordered list item Unordered list item Hard LinebreakEnd a line with two or more spaces will create a hard linebreak, called &lt;br /&gt; in HTML. ( Control + Return )Above line ended with 2 spaces. 水平线Three or more asterisks or dashes: 标题Setext-style: This is H1This is H2atx-style: This is H1This is H2This is H3This is H4This is H5This is H6附加语法Footnotes脚注主要像参考样式链接。一个脚注由两个东西组成：文本中的一个标记将成为一个上标数字；一个脚注定义，将放在文档结尾的脚注列表中。脚注看起来像这样： That’s some text with a footnote.[^1] [^1]: And that’s the footnote. 删除线Wrap with 2 tilde characters: Strikethrough 栅栏代码块Start with a line containing 3 or more backticks, and ends with the first line with the same number of backticks: 123Fenced code blocks are like Stardard Markdown’s regular codeblocks, except that they’re not indented and instead rely ona start and end fence lines to delimit the code block. 表格A simple table looks like this: First Header Second Header Third Header Content Cell Content Cell Content Cell Content Cell Content Cell Content Cell If you wish, you can add a leading and tailing pipe to each line of the table: First Header Second Header Third Header Content Cell Content Cell Content Cell Content Cell Content Cell Content Cell Specify alignment for each column by adding colons to separator lines: First Header Second Header Third Header Left Center Right Left Center Right","categories":[],"tags":[{"name":"markdown","slug":"markdown","permalink":"http://yoursite.com/tags/markdown/"},{"name":"编辑器","slug":"编辑器","permalink":"http://yoursite.com/tags/编辑器/"}]},{"title":"Markdown简明版使用指南","slug":"Markdown简明版使用指南","date":"2018-07-19T04:53:53.000Z","updated":"2018-07-19T10:00:42.254Z","comments":true,"path":"2018/07/19/Markdown简明版使用指南/","link":"","permalink":"http://yoursite.com/2018/07/19/Markdown简明版使用指南/","excerpt":"","text":"简介Markdown是一种可以使用普通文本编辑器编写的标记语言，通过简单的标记语法，它可以使普通文本内容具有一定的格式。Markdown具有一系列衍生版本，用于扩展Markdown的功能（如表格、脚注、内嵌HTML等等），这些功能原初的Markdown尚不具备，它们能让Markdown转换成更多的格式，例如LaTeX，Docbook。Markdown增强版中比较有名的有Markdown Extra、MultiMarkdown、 Maruku等。这些衍生版本要么基于工具，如Pandoc；要么基于网站，如GitHub和Wikipedia，在语法上基本兼容，但在一些语法和渲染效果上有改动。 ###使用指南 标题标题能显示出文章的结构。行首插入1-6个 # ，每增加一个 # 表示更深入层次的内容，对应到标题的深度由 1-6 阶 文本样式（带“”星号的文本样式，在原版Markdown标准中不存在，但在其大部分衍生标准中被添加）链接 :Title加粗 :Bold斜体字 :Italics 高亮 :==text==段落 : 段落之间空一行换行符 : 一行结束时输入两个空格列表 :* 添加星号成为一个新的列表项。引用 :&gt; 引用内容内嵌代码 : alert(&#39;Hello World&#39;);画水平线 (HR) :——– 图片使用Markdown将图像插入文章，你需要在Markdown编辑器输入 。 这时在预览面板中会自动创建一个图像上传框。你可以从电脑桌面拖放图片(.png, .gif, .jpg)到上传框, 或者点击图片上传框使用标准的图像上传方式。 如果你想通过链接插入网络上已经存在的图片，只要单击图片上传框的左下角的“链接”图标，这时就会呈现图像URL的输入框。想给图片添加一个标题, 你需要做的是将标题文本插图中的方括号，e.g;. 插入图片有两种方式：行内式和参数式行内式 参数式[图片2]:(图片地址)用法跟链接的基本一样，唯一的不同就是，图片前面要写一个！（这是必须的），没什么好说的 ####区块引用比如说，你想对某个部分做的内容做一些说明或者引用某某的话等，可以用这个语句 语法 在之前加上“&gt;” 代码框这个就比较重要了，很多时候都需要展示出一些代码alert(&quot;nice ti meet you!&quot;)如果代码量比较少，只有单行的话，可以用单反引号包起来 多行用三个反引号，如果要写注释，可以在反引号后面写123function sum(a,b)&#123; return a+b;&#125; 华丽的分割线分割线可以由* - _（星号，减号，底线）这3个符号的至少3个符号表示，注意至少要3个，且不需要连续，有空格也可以 删除线只需要在文字前后加上两个~~ 使用链接就是这么简单 代码部分1234567891011//撤销申购$$(&quot;.clickbutton .waitfirstTrial&quot;).click(function()&#123; console.log(&quot;当前id&quot;,location.href.split(&quot;=&quot;)[1]); var orderId=location.href.split(&quot;=&quot;)[1]; Server.revokeApplypurchase(&#123;orderId:orderId&#125;,function(data)&#123; console.log(111111); &#125;); // Server.getShopcarNum(&#123; farmId: SYKTools.cookie(Server.currentFarmId) &#125;, // function (data) &#123;console.log(data)&#125; // )&#125;)","categories":[],"tags":[{"name":"markdown","slug":"markdown","permalink":"http://yoursite.com/tags/markdown/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-07-16T14:19:34.280Z","updated":"2018-07-16T14:19:34.280Z","comments":true,"path":"2018/07/16/hello-world/","link":"","permalink":"http://yoursite.com/2018/07/16/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}